Examinator/src/Catalogs/ГлоссарииСУЗ/ГлоссарииСУЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ГлоссарииСУЗ</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоказыватьАлфавит</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоказыватьСОпределением</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипОбъектаСУЗ</name>
    <type>
      <types>EnumRef.ТипыОбъектовСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>Шаблон</name>
    <type>
      <types>CatalogRef.ШаблоныСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>Поставщик</name>
    <type>
      <types>CatalogRef.ПоставщикиСУЗ</types>
    </type>
  </attributes>
</mdclass:Catalog>

Examinator/src/Enums/ПеременныеТерминовСУЗ/ПеременныеТерминовСУЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ПеременныеТерминовСУЗ</name>
  <enumValues>
    <name>Термин</name>
  </enumValues>
  <enumValues>
    <name>Определение</name>
  </enumValues>
  <enumValues>
    <name>Синоним</name>
  </enumValues>
  <enumValues>
    <name>Пропустить</name>
  </enumValues>
  <enumValues>
    <name>СкрытьАвтоСсылки</name>
  </enumValues>
</mdclass:Enum>

Examinator/src/Catalogs/СводыЗнанийСУЗ/СводыЗнанийСУЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СводыЗнанийСУЗ</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>РуководствоПользователя</name>
      <description>Руководство пользователя</description>
    </items>
  </predefined>
  <attributes>
    <name>Версия</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Карта</name>
    <type>
      <types>CatalogRef.КартыСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>Поставщик</name>
    <type>
      <types>CatalogRef.ПоставщикиСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>Редакция</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтартоваяСтраница</name>
    <type>
      <types>CatalogRef.СтраницыСУЗ</types>
      <types>CatalogRef.КартыСУЗ</types>
      <types>CatalogRef.РесурсыСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипОбъектаСУЗ</name>
    <type>
      <types>EnumRef.ТипыОбъектовСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>Шаблон</name>
    <type>
      <types>CatalogRef.ШаблоныСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоказыватьПоследнююВерсию</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредпочитатьПоставщика</name>
    <type>
      <types>CatalogRef.ПоставщикиСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>Тип</name>
    <type>
      <types>EnumRef.ТипыЭлектронныхРесурсовСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоследовательнаяНавигация</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СкрытьСодержание</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Глоссарий</name>
    <type>
      <types>CatalogRef.ГлоссарииСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>СправочнаяИнформация</name>
    <type>
      <types>CatalogRef.СтраницыСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>Базовый</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоказыватьПервуюСсылкуНаТермин</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоказыватьТерминВсплывающейПодсказкой</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Идентификатор</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>БлокироватьНепройденное</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ПользовательскиеНастройки</name>
    <attributes>
      <name>ВидНастройки</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ВидыНастроекЭлектронныхРесурсовСУЗ</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СкрытыеРесурсы</name>
    <attributes>
      <name>Ресурс</name>
      <type>
        <types>CatalogRef.ПодборкиСУЗ</types>
        <types>CatalogRef.ФреймыСУЗ</types>
        <types>CatalogRef.СтраницыСУЗ</types>
        <types>CatalogRef.ГлоссарииСУЗ</types>
        <types>CatalogRef.РесурсыСУЗ</types>
        <types>CatalogRef.СводыЗнанийСУЗ</types>
        <types>CatalogRef.ВопросыСУЗ</types>
      </type>
    </attributes>
    <attributes>
      <name>ВыгружатьПриОткрытии</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Размер</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>УдалитьГруппыПодчиненныхЭлементов</name>
    <attributes>
      <name>Группа</name>
      <type>
        <types>CatalogRef.ПодборкиСУЗ</types>
        <types>CatalogRef.ФреймыСУЗ</types>
        <types>CatalogRef.ТерминыСУЗ</types>
        <types>CatalogRef.СтраницыСУЗ</types>
        <types>CatalogRef.ГлоссарииСУЗ</types>
        <types>CatalogRef.РесурсыСУЗ</types>
        <types>CatalogRef.ВопросыСУЗ</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Examinator/src/Catalogs/ТерминыСУЗ/ТерминыСУЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ТерминыСУЗ</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>БукваДляПоиска</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Шаблон</name>
    <type>
      <types>CatalogRef.ШаблоныСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипОбъектаСУЗ</name>
    <type>
      <types>EnumRef.ТипыОбъектовСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Поставщик</name>
    <type>
      <types>CatalogRef.ПоставщикиСУЗ</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Синонимы</name>
    <comment>Синонимы</comment>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>БукваДляПоиска</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Examinator/src/Catalogs/ОпределенияТерминаСУЗ/ОпределенияТерминаСУЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ОпределенияТерминаСУЗ</name>
  <owners>Catalog.ТерминыСУЗ</owners>
  <attributes>
    <name>Текст</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Элемент</name>
    <type>
      <types>CatalogRef.ФреймыСУЗ</types>
      <types>CatalogRef.СтраницыСУЗ</types>
      <types>CatalogRef.РесурсыСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстСлева</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Поставщик</name>
    <type>
      <types>CatalogRef.ПоставщикиСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗагруженоИзФайла</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

Examinator/src/Catalogs/ГлоссарииСУЗ/Forms/ФормаИмпортаГлоссария/Module.bsl
#Область ОбработчикиСобытийФормы

// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	// Устанавливаем начальные настройки
	
	ПутьКФайлуСТерминами       = Параметры.ФайлДляЗагрузки;
	ЭлектронныйРесурс          = Параметры.ЭлектронныйРесурс;
	РодительЭлементаСодержания = ?(Параметры.ЭлементСодержания.ЭтоГруппа, Параметры.ЭлементСодержания, Параметры.ЭлементСодержания.Родитель);
    ГлоссарийДляОбновления     = Параметры.ГлоссарийДляОбновления;
	ЗакрыватьПослеЗагрузки     = Параметры.ЗакрыватьПослеЗагрузки;
	
	Если ЗначениеЗаполнено(ГлоссарийДляОбновления) Тогда
		ИмяВладельцаТерминов = "Глоссарий";
	ИначеЕсли ЗначениеЗаполнено(ЭлектронныйРесурс) Тогда
		ИмяВладельцаТерминов = "ЭлектронныйРесурс";	
	Иначе
		ИмяВладельцаТерминов = "СправочникТерминов";
	КонецЕсли;
	
	Если ИмяВладельцаТерминов = "ЭлектронныйРесурс" ИЛИ ИмяВладельцаТерминов = "Глоссарий" Тогда
		СформироватьГлоссарии = Истина;
	КонецЕсли;
	
	// Устанавливаем доступность элементов
	
	УстановитьДоступностьЭлементовФормы();

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	#Если ВебКлиент Тогда
		
	ПоказатьПредупреждение(,НСтр("ru = 'Загрузка терминов в веб-клиенте не поддерживается'"));
	
	Отказ = Истина;
	
	Возврат;
	
	#Иначе
		
	Если ЗначениеЗаполнено(ПутьКФайлуСТерминами) Тогда
		ПрочитатьДанныеИзФайлаГлоссария();
	КонецЕсли;
	
	#КонецЕсли

КонецПроцедуры

#КонецОбласти


#Область ОбработчикиСобытийЭлементовШапкиФормы

// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ

&НаКлиенте
Процедура СформироватьГлоссарииПриИзменении(Элемент)
	
	УстановитьДоступностьЭлементовФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ЭлектронныйРесурсОткрытие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ОбъектыСУЗКлиент.РедактироватьЭлектронныйРесурс(ЭлектронныйРесурс);

КонецПроцедуры

&НаКлиенте
Процедура ПутьКФайлуСТерминамиПриИзменении(Элемент)
	ПрочитатьДанныеИзФайлаГлоссария();
КонецПроцедуры

&НаКлиенте
Процедура ПутьКФайлуСТерминамиНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)

	// Формируем диалог выбора файлов
	
	Фильтр = НСтр("ru = 'Файл MS Excel '") + "(*.xls;*.xlsx)|*.xls;*.xlsx";
	
	ДиалогОткрытияФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	ДиалогОткрытияФайла.ПолноеИмяФайла     = "";
	ДиалогОткрытияФайла.Фильтр             = Фильтр;
	ДиалогОткрытияФайла.МножественныйВыбор = Ложь;
	ДиалогОткрытияФайла.Заголовок          = НСтр("ru = 'Выберите файлы для загрузки'");
	
	Если НЕ ДиалогОткрытияФайла.Выбрать() Тогда
		Возврат;
	КонецЕсли;
	
	ПутьКФайлуСТерминами = ДиалогОткрытияФайла.ПолноеИмяФайла;
	
	ПрочитатьДанныеИзФайлаГлоссария();
	
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиКомандФормы

// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

&НаКлиенте
Процедура ВыполнитьИмпорт(Команда)
	
	// Делаем проверки
	
	Если ИмяВладельцаТерминов = "ЭлектронныйРесурс" И НЕ ЗначениеЗаполнено(ЭлектронныйРесурс) Тогда
		Текст = НСтр("ru = 'Укажите электронный курс, в который будет загружен глоссарий'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст,,,"ЭлектронныйРесурс");
		Возврат;
	КонецЕсли;
	
	// Делаем импорт
	
	Если ВыполнитьИмпортПакетаДанных() Тогда
	
		// Сохраняем настройки
		
		ФайлНастроекОбъект = Новый Файл(ПолучитьИмяФайлаНастроек(ПутьКФайлуСТерминами));
			
		ТекстовыйДокументФН = Новый ТекстовыйДокумент;	
		ТекстовыйДокументФН.УстановитьТекст(СформироватьТекстФайлаНастроек());
		ТекстовыйДокументФН.Записать(ФайлНастроекОбъект.ПолноеИмя);
		
		ФайлНастроекОбъект.УстановитьНевидимость(Истина);
		
		// Оповещаем другие формы
		
		МассивИмпортированныхГлоссариев = Новый Массив();
		
		Для каждого Строка Из Глоссарии Цикл
			
			Если ЗначениеЗаполнено(Строка.Глоссарий) Тогда
				МассивИмпортированныхГлоссариев.Добавить(Строка.Глоссарий);
			КонецЕсли;
		
		КонецЦикла;
		
		Оповестить("ЭлектронныйРесурсОбновлен", ЭлектронныйРесурс, ЭтотОбъект);
		Оповестить("ГлоссарийОбновлен", ГлоссарийДляОбновления, ЭтотОбъект);
		
		// Завершаем
		
		ОписаниеОповещения = Новый ОписаниеОповещения("ОбработкаЗавершенияИмпорта", ЭтотОбъект);		
			
		ПоказатьПредупреждение(ОписаниеОповещения, НСтр("ru = 'Загрузка успешно завершена'"));

	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаЗавершенияИмпорта(ДополнительныеПараметры) Экспорт
	
	Если ЗакрыватьПослеЗагрузки Тогда
		Закрыть(Истина);
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ШаблонФайлаСТерминами(Команда)
	ПолучитьФайл(ПолучитьАдресХраненияШаблонаФайлаСТерминами(), "GlossaryTemplate.xls", Истина);
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

// ОБЩЕЕ

&НаКлиенте
Процедура ПрочитатьДанныеИзФайлаГлоссария()
	
	#Если НЕ ВебКлиент Тогда
		
	// Очищаем данные
	//
	
	ДанныеЛистов = Неопределено;
	
	Колонки.Очистить();
	Термины.Очистить();
	Глоссарии.Очистить();		
	
	// Делаем проверки
	//
	
	Если НЕ ЗначениеЗаполнено(ПутьКФайлуСТерминами) Тогда
		Возврат;
	КонецЕсли;
	
	// Читаем данные из файла
	//	
	
	Попытка
		ExcelApp = Новый COMObject("Excel.Application");
	Исключение
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Программа Excel не найдена '") + ОписаниеОшибки());
	КонецПопытки;
	
	Книга = ExcelApp.WorkBooks.Open(ПутьКФайлуСТерминами, 0);
	
	// Определяем колонки таблицы
		
	Лист1 = Книга.WorkSheets(1);
	
	НомерКолонки = 1;
	ИмяКолонки   = Лист1.Cells(1, НомерКолонки).Value;
	
	Пока ЗначениеЗаполнено(ИмяКолонки) Цикл
		
		НоваяСтрока = Колонки.Добавить();
		НоваяСтрока.Имя   = ИмяКолонки;
		НоваяСтрока.Номер = НомерКолонки;
		
		Попытка
			НоваяСтрока.Значение = ПредопределенноеЗначение("Перечисление.ПеременныеТерминовСУЗ." + ИмяКолонки);
		Исключение
			НоваяСтрока.Значение = ПредопределенноеЗначение("Перечисление.ПеременныеТерминовСУЗ.ПустаяСсылка");
		КонецПопытки;
		
		НомерКолонки = НомерКолонки + 1;
		ИмяКолонки   = Лист1.Cells(1, НомерКолонки).Value;
		
	КонецЦикла;
	
	// Формируем данные терминов для передачи на сервер
	
	КоличествоЛистов = Книга.WorkSheets.Count;
	
	МассивЛистов = Новый Массив();
	
	Для НомерЛиста = 1 По КоличествоЛистов Цикл // Перебираем листы
			
		Лист     = Книга.WorkSheets(НомерЛиста);
		ИмяЛиста = Лист.Name;
		
		// Проверяем не пустой ли лист
		
		Если Лист.UsedRange.Rows.Count = 1
			И Лист.UsedRange.Columns.Count = 1
			И ПустаяСтрока(Строка(Лист.Cells(1,1).Value)) Тогда
			
			Продолжить;
			
		КонецЕсли;
			
		// Термины
		
		МассивТерминов = Новый Массив();
		
		ТерминыЗакончились = Ложь;
		НомерСтроки = 2; // Первая строка используется для названий колонок
		
		Пока НЕ ТерминыЗакончились Цикл // Перебираем термины (строки листа)
			
			// Формируем массив свойств термина
			
			МассивСвойств = Новый Массив;
			
			Для каждого Колонка Из Колонки Цикл
				
				ЗначениеЯчейки = СокрЛП(Строка(Лист.Cells(НомерСтроки, Колонка.Номер).Value));
						
				МассивСвойств.Добавить(ЗначениеЯчейки);
				
			КонецЦикла;
			
			// Определяем, закончились ли термины
			
			ТерминыЗакончились = Истина;
			
			Для каждого СвойствоВопроса Из МассивСвойств Цикл
			
				Если ЗначениеЗаполнено(СвойствоВопроса) Тогда
					ТерминыЗакончились = Ложь;
					Прервать;
				КонецЕсли;
			
			КонецЦикла;
			
			// Переходим к следующему вопросу
			
			Если НЕ ТерминыЗакончились Тогда
				
				МассивТерминов.Добавить(Новый ФиксированныйМассив(МассивСвойств));
				
				НомерСтроки = НомерСтроки + 1;
				
			КонецЕсли;
			
		КонецЦикла;
		
		Если МассивТерминов.Количество() > 0 Тогда
			
			МассивЛистов.Добавить(Новый ФиксированныйМассив(МассивТерминов));
			
			НовыйГлоссарий = Глоссарии.Добавить();
			НовыйГлоссарий.Имя                = ИмяЛиста;
			НовыйГлоссарий.КоличествоТерминов = МассивТерминов.Количество();
			НовыйГлоссарий.Номер              = НомерЛиста;
			
			Если КоличествоЛистов = 1 Тогда
				НовыйГлоссарий.Главный = Истина;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	ДанныеЛистов = Новый ФиксированныйМассив(МассивЛистов); // Данные будут обработаны на сервере 
	
	// Закрываем таблицу
	
	Книга.Close();
	
	// Заполняем таблицу терминов
	
	ЗаполнитьТаблицуТерминов(); // На сервере
	
	// Получаем настройки из файла
	//
	
	ПолучитьФайлНастроек();	
	
	#КонецЕсли
	
КонецПроцедуры

&НаСервере
Функция ВыполнитьИмпортПакетаДанных()
	
	// Делаем проверки
	
	ЕстьПолеТермин      = Ложь;
	ЕстьПолеОпределение = Ложь;
	
	Для каждого Строка Из Колонки Цикл
		
		Если Строка.Значение = Перечисления.ПеременныеТерминовСУЗ.Термин Тогда
			ЕстьПолеТермин = Истина;
		КонецЕсли;
		
		Если Строка.Значение = Перечисления.ПеременныеТерминовСУЗ.Определение Тогда
			ЕстьПолеОпределение = Истина;
		КонецЕсли;
		
	КонецЦикла;
	
	Если НЕ ЕстьПолеТермин Тогда
		Текст = НСтр("ru = 'Укажите поле ""Термин""'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст);
		Возврат Ложь;
	КонецЕсли;
	
	Если НЕ ЕстьПолеОпределение Тогда
		Текст = НСтр("ru = 'Укажите поле ""Определение""'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст);
		Возврат Ложь;
	КонецЕсли;
	
	// Загружаем данные
	
	НачатьТранзакцию();
	
	НомерЛиста = 0;
	
	Для каждого ДанныеЛиста Из ДанныеЛистов Цикл
		
		// Получаем переменные
		
		ПараметрыЛиста = Глоссарии.Получить(НомерЛиста);
		ИмяЛиста       = ПараметрыЛиста.Имя;
		
		// Получаем элементы справочников
		
		Если СформироватьГлоссарии Тогда
			
			Если ЗначениеЗаполнено(ГлоссарийДляОбновления) Тогда
				
				Глоссарий         = ГлоссарийДляОбновления;
				ЭлементСодержания = Неопределено;
				
			Иначе
				
				Глоссарий         = ПараметрыЛиста.Глоссарий;
				ЭлементСодержания = ПараметрыЛиста.ЭлементСодержанияДляОбновления;
				
				Если ЗначениеЗаполнено(ЭлементСодержания) Тогда
					
					ГлоссарийЭлементаСодержания = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЭлементСодержания, "СсылкаНаЭлемент");
					
					Если НЕ ЗначениеЗаполнено(Глоссарий) ИЛИ ГлоссарийЭлементаСодержания <> Глоссарий Тогда
						Глоссарий = ГлоссарийЭлементаСодержания;
						ПараметрыЛиста.Глоссарий = Глоссарий;
					КонецЕсли;
					
				КонецЕсли;
						
			КонецЕсли;
			
			Если ТипЗнч(Глоссарий) <> Тип("СправочникСсылка.ГлоссарииСУЗ") Тогда
				Глоссарий = Неопределено;
			КонецЕсли;	
			
			// Формируем глоссарий и элемент содержания электронного ресурса
			
			Если НЕ ОбщегоНазначенияСУКлиентСервер.СсылкаСуществуетВБазе(Глоссарий) Тогда
				
				ГлоссарийОбъект = Справочники.ГлоссарииСУЗ.СоздатьЭлемент();
				
				Если ЗначениеЗаполнено(Глоссарий) Тогда 
						
					// Ссылка есть, но в базе объекта нет
					
					ГлоссарийОбъект.УстановитьСсылкуНового(Глоссарий);
						
				КонецЕсли;
				
				ГлоссарийОбъект.Наименование            = ИмяЛиста;
				ГлоссарийОбъект.Родитель                = Справочники.СводыЗнанийСУЗ.ГруппаДляХраненияПодчиненныхЭлементов(ЭлектронныйРесурс, Тип("СправочникСсылка.ГлоссарииСУЗ"));
				ГлоссарийОбъект.ПоказыватьАлфавит       = Истина;
				ГлоссарийОбъект.ПоказыватьСОпределением = Истина;
				
				РазработкаСУЗ.УстановитьПредпочитаемогоПоставщика(ГлоссарийОбъект);
				
				ГлоссарийОбъект.Записать();
				
				Глоссарий = ГлоссарийОбъект.Ссылка;
				
				ПараметрыЛиста.Глоссарий = Глоссарий;
				
			Иначе
				
				ГлоссарийОбъект = Глоссарий.ПолучитьОбъект();
				
				ГлоссарийОбъект.Записать(); // Обновляем дату изменения
				
			КонецЕсли;
			
			Если НЕ ПараметрыЛиста.Скрыть
				И НЕ ПараметрыЛиста.Главный
				И ИмяВладельцаТерминов = "ЭлектронныйРесурс"
				И ЗначениеЗаполнено(ЭлектронныйРесурс)
				И НЕ ЗначениеЗаполнено(ЭлементСодержания) Тогда
				
				ЭлементСодержанияОбъект = Справочники.СодержаниеСУЗ.СоздатьЭлемент();
				ЭлементСодержанияОбъект.Наименование    = ИмяЛиста;
				ЭлементСодержанияОбъект.Владелец        = ЭлектронныйРесурс;
				ЭлементСодержанияОбъект.СсылкаНаЭлемент = Глоссарий;
				ЭлементСодержанияОбъект.Родитель        = РодительЭлементаСодержания;
				
				РазработкаСУЗ.УстановитьПредпочитаемогоПоставщика(ЭлементСодержанияОбъект);

				ЭлементСодержанияОбъект.Записать();
				
				ЭлементСодержания = ЭлементСодержанияОбъект.Ссылка;
				
				ПараметрыЛиста.ЭлементСодержанияДляОбновления = ЭлементСодержания;
				
			КонецЕсли;
			
			Если ПараметрыЛиста.Главный
				И ИмяВладельцаТерминов = "ЭлектронныйРесурс"
				И ЗначениеЗаполнено(ЭлектронныйРесурс) Тогда
				
				ЭлектронныйРесурсОбъект = ЭлектронныйРесурс.ПолучитьОбъект();
				ЭлектронныйРесурсОбъект.Глоссарий = Глоссарий;
				ЭлектронныйРесурсОбъект.Записать();
				
			КонецЕсли;
			
		КонецЕсли;
		
		// Загружаем термины
		
		Для каждого ДанныеТермина Из ДанныеЛиста Цикл
			
			// Получаем данные термина из файла
			
			ПропуститьТермин              = РазработкаСУЗ.ПолучитьЗначенияПеременнойИзФайлаExcel(ДанныеТермина, Колонки, Перечисления.ПеременныеТерминовСУЗ["Пропустить"], Истина, Неопределено, "Булево");
			НаименованиеТермина           = РазработкаСУЗ.ПолучитьЗначенияПеременнойИзФайлаExcel(ДанныеТермина, Колонки, Перечисления.ПеременныеТерминовСУЗ["Термин"], Истина);
			ТекстОпределенияТермина       = РазработкаСУЗ.ПолучитьЗначенияПеременнойИзФайлаExcel(ДанныеТермина, Колонки, Перечисления.ПеременныеТерминовСУЗ["Определение"], Истина);
			ПредставленияСинонимовТермина = РазработкаСУЗ.ПолучитьЗначенияПеременнойИзФайлаExcel(ДанныеТермина, Колонки, Перечисления.ПеременныеТерминовСУЗ["Синоним"], Ложь);
			СкрытьАвтоСсылки              = РазработкаСУЗ.ПолучитьЗначенияПеременнойИзФайлаExcel(ДанныеТермина, Колонки, Перечисления.ПеременныеТерминовСУЗ["СкрытьАвтоСсылки"], Истина, Ложь, "Булево");
			
			Если (ПропуститьТермин <> Неопределено И ПропуститьТермин) ИЛИ НЕ ЗначениеЗаполнено(НаименованиеТермина) Тогда
				Продолжить;
			КонецЕсли;
			
			// Сохраняем данные термина
			
			ТерминОбъект = Неопределено;
			
			НастройкиТермина = Термины.НайтиСтроки(Новый Структура("Наименование", НаименованиеТермина))[0];
			
			Если ЗначениеЗаполнено(НастройкиТермина.Термин) Тогда
				
				Если ОбщегоНазначенияСУКлиентСервер.СсылкаСуществуетВБазе(НастройкиТермина.Термин) Тогда
					
					ТерминОбъект = НастройкиТермина.Термин.ПолучитьОбъект();	
					
				Иначе
					
					ТерминОбъект = Справочники.ТерминыСУЗ.СоздатьЭлемент();
					
					ТерминОбъект.УстановитьСсылкуНового(НастройкиТермина.Термин);
					
					РазработкаСУЗ.УстановитьПредпочитаемогоПоставщика(ТерминОбъект);
					
				КонецЕсли;
				
			КонецЕсли;
			
			Если ИскатьПоНаименованию И ТерминОбъект = Неопределено Тогда

				СсылкаНаТермин = ОбщегоНазначенияСУ.НайтиЭлементСправочника("ТерминыСУЗ", "Наименование", НаименованиеТермина,, Ложь);
				
				Если ЗначениеЗаполнено(СсылкаНаТермин) Тогда
					ТерминОбъект = СсылкаНаТермин.ПолучитьОбъект();
				КонецЕсли;
				
			КонецЕсли;
			
			Если ТерминОбъект = Неопределено Тогда
				
				ТерминОбъект = Справочники.ТерминыСУЗ.СоздатьЭлемент();
				
				РазработкаСУЗ.УстановитьПредпочитаемогоПоставщика(ТерминОбъект);
				
			КонецЕсли;
			
			ТерминОбъект.Наименование   = НаименованиеТермина;
			ТерминОбъект.БукваДляПоиска = РазработкаСУЗКлиентСервер.ПолучитьБуквуДляПоиска(НаименованиеТермина);
			
			Если НЕ ЗначениеЗаполнено(ТерминОбъект.Родитель) Тогда
				ТерминОбъект.Родитель = Справочники.СводыЗнанийСУЗ.ГруппаДляХраненияПодчиненныхЭлементов(ЭлектронныйРесурс, Тип("СправочникСсылка.ТерминыСУЗ"));
			КонецЕсли;
			
			Для каждого ПредставлениеСинонима Из ПредставленияСинонимовТермина Цикл
			
				СтрокаТЧ = ТерминОбъект.Синонимы.Найти(ПредставлениеСинонима, "Представление");  	
				
				Если СтрокаТЧ = Неопределено Тогда
					СтрокаТЧ = ТерминОбъект.Синонимы.Добавить();
				КонецЕсли;
				
				СтрокаТЧ.Представление  = ПредставлениеСинонима;
				СтрокаТЧ.БукваДляПоиска = РазработкаСУЗКлиентСервер.ПолучитьБуквуДляПоиска(СтрокаТЧ.Представление); 
				
			КонецЦикла;
			
			ТерминОбъект.Записать();
			
			Термин = ТерминОбъект.Ссылка;
			
			// Сохраняем ссылку на вопрос в настройках
			
			НастройкиТермина = Термины.НайтиСтроки(Новый Структура("Наименование", НаименованиеТермина))[0];

			НастройкиТермина.Термин = Термин;
			
			// Указываем определение термина

			Запрос = Новый Запрос;
			Запрос.Текст = 
				"ВЫБРАТЬ
				|	ОпределенияТерминаСУЗ.Ссылка,
				|	ОпределенияТерминаСУЗ.ЗагруженоИзФайла
				|ИЗ
				|	Справочник.ОпределенияТерминаСУЗ КАК ОпределенияТерминаСУЗ
				|ГДЕ
				|	ОпределенияТерминаСУЗ.ПометкаУдаления = ЛОЖЬ
				|	И ОпределенияТерминаСУЗ.Владелец = &Термин";

			Запрос.УстановитьПараметр("Термин", Термин);

			Результат = Запрос.Выполнить();
			
			Если Результат.Пустой() Тогда
				
				ОпределениеТерминаОбъект = Справочники.ОпределенияТерминаСУЗ.СоздатьЭлемент();
				
				ОпределениеТерминаОбъект.Владелец         = Термин;
				ОпределениеТерминаОбъект.ЗагруженоИзФайла = Истина;
				
				РазработкаСУЗ.УстановитьПредпочитаемогоПоставщика(ОпределениеТерминаОбъект);
				
			Иначе
				
				ВыборкаДетальныеЗаписи = Результат.Выбрать();

				ВыборкаДетальныеЗаписи.Следующий();
				
				ОпределениеТермина = ВыборкаДетальныеЗаписи.Ссылка;
				
				Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
					
					Если ВыборкаДетальныеЗаписи.ЗагруженоИзФайла Тогда 
						ОпределениеТермина = ВыборкаДетальныеЗаписи.Ссылка; // Загруженные из файла имеют приоритет	
					КонецЕсли;
					
				КонецЦикла;
				
				ОпределениеТерминаОбъект = ОпределениеТермина.ПолучитьОбъект();
				
			КонецЕсли;
			
			ОпределениеТерминаОбъект.Текст = ТекстОпределенияТермина;
			
			ОпределениеТерминаОбъект.Записать();
			
			// Помещаем термин в глоссарий
			
			Если СформироватьГлоссарии И ЗначениеЗаполнено(Глоссарий) Тогда
				Справочники.ГлоссарииСУЗ.ДобавитьТерминВГлоссарий(Термин, Глоссарий, СкрытьАвтоСсылки);
			КонецЕсли;
			
		КонецЦикла; // Термины
		
		НомерЛиста = НомерЛиста + 1;
		
	КонецЦикла; // Листы
	
	ЗафиксироватьТранзакцию();
	
	Возврат Истина;
	
КонецФункции

&НаСервере
Процедура УстановитьДоступностьЭлементовФормы()
	
	Элементы.СтраницаГлоссарии.Видимость = ?(ИмяВладельцаТерминов = "ЭлектронныйРесурс" И СформироватьГлоссарии, Истина, Ложь);
	
	Если ИмяВладельцаТерминов = "СправочникТерминов" Тогда
		
		Элементы.ГруппаЗагрузить.Видимость = Ложь;
		
	Иначе
		
		Элементы.ГруппаЗагрузить.Видимость = Истина;
		
		Элементы.ГруппаЭлектронныйРесурс.Видимость = ?(ИмяВладельцаТерминов = "ЭлектронныйРесурс", Истина, Ложь);
		
	КонецЕсли;	
	
	Элементы.СформироватьГлоссарии.Доступность = ?(ИмяВладельцаТерминов = "ЭлектронныйРесурс", Истина, Ложь);
	
	Если ЗначениеЗаполнено(Параметры.ФайлДляЗагрузки) Тогда
		Элементы.ПутьКФайлуСТерминами.ТолькоПросмотр = Истина;
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблицуТерминов()
	
	Для каждого ДанныеЛиста Из ДанныеЛистов Цикл
		
		Для каждого ДанныеТермина Из ДанныеЛиста Цикл
			
			ПропуститьТермин = РазработкаСУЗ.ПолучитьЗначенияПеременнойИзФайлаExcel(ДанныеТермина, Колонки, Перечисления.ПеременныеТерминовСУЗ["Пропустить"], Истина, Неопределено, "Булево");
			
			Если (ПропуститьТермин <> Неопределено И ПропуститьТермин) Тогда
				Продолжить;
			КонецЕсли;
			
			НоваяСтрока = Термины.Добавить();
			
			НоваяСтрока.Наименование     = РазработкаСУЗ.ПолучитьЗначенияПеременнойИзФайлаExcel(ДанныеТермина, Колонки, Перечисления.ПеременныеТерминовСУЗ["Термин"], Истина);
			НоваяСтрока.СкрытьАвтоСсылки = РазработкаСУЗ.ПолучитьЗначенияПеременнойИзФайлаExcel(ДанныеТермина, Колонки, Перечисления.ПеременныеТерминовСУЗ["СкрытьАвтоСсылки"], Истина, Ложь, "Булево");
			
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьАдресХраненияШаблонаФайлаСТерминами()
	
	ДвоичныеДанные = Справочники.ГлоссарииСУЗ.ПолучитьМакет("ШаблонФайловДляИмпорта");
	
	Возврат ПоместитьВоВременноеХранилище(ДвоичныеДанные, УникальныйИдентификатор);
	
КонецФункции

// ФАЙЛ НАСТРОЕК

&НаСервере
Функция СформироватьТекстФайлаНастроек()
	
	// Получаем нужные переменные
	//
	
	ПутьКФайлуСТерминамиОбъект = Новый Файл(ПутьКФайлуСТерминами);
	
	// Получаем XDTO
	//
	
	ФайлНастроекXDTOТип = ФабрикаXDTO.Тип("http://v8.1c.ru/kms/1/ImportGlossarySettings", "Файлы");
	ФайлНастроекXDTO = ФабрикаXDTO.Создать(ФайлНастроекXDTOТип);
	
	Если ЗначениеЗаполнено(АдресФайлаНастроекВХранилище) Тогда
		
		ПутьКФайлуНастроекНаСервере = ПолучитьИмяВременногоФайла("xml");
		
		ДвоичныеДанныеФайла = ПолучитьИзВременногоХранилища(АдресФайлаНастроекВХранилище);
		ДвоичныеДанныеФайла.Записать(ПутьКФайлуНастроекНаСервере);
		
		ЧтениеXML = Новый ЧтениеXML;
		ЧтениеXML.ОткрытьФайл(ПутьКФайлуНастроекНаСервере);
		
		// Получаем XDTO-объект файла настроек
		
		ФайлНастроекXDTO = ФабрикаXDTO.ПрочитатьXML(ЧтениеXML, ФайлНастроекXDTOТип); 
		
	КонецЕсли;
	
	// Ищем ФайлXDTO в существующем файле
	//
	
	ФайлXDTO = Неопределено;
	
	Для каждого Строка Из ФайлНастроекXDTO.Файл Цикл
	
		Если Строка.Имя = ПутьКФайлуСТерминамиОбъект.Имя Тогда	
			ФайлXDTO = Строка;
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
	// Добавляем новое описание файла
	
	Если ФайлXDTO = Неопределено Тогда
		
		ФайлXDTOТип  = ФабрикаXDTO.Тип("http://v8.1c.ru/kms/1/ImportGlossarySettings", "Файл");
		ФайлXDTO     = ФабрикаXDTO.Создать(ФайлXDTOТип);
		
		ФайлНастроекXDTO.Файл.Добавить(ФайлXDTO);
		
	КонецЕсли;
	
	// Сохраняем настройки в файл
	//
	
	// Простые свойства
	
	ФайлXDTO.Имя = ПутьКФайлуСТерминамиОбъект.Имя;
	
	// Колонки (перезаписываем старый список всегда)
	
	КолонкиXDTOТип  = ФабрикаXDTO.Тип("http://v8.1c.ru/kms/1/ImportGlossarySettings", "Колонки");
	КолонкиXDTO     = ФабрикаXDTO.Создать(КолонкиXDTOТип);
	
	КолонкаXDTOТип  = ФабрикаXDTO.Тип("http://v8.1c.ru/kms/1/ImportGlossarySettings", "Колонка");
	
	Для каждого Строка Из Колонки Цикл
	
		КолонкаXDTO = ФабрикаXDTO.Создать(КолонкаXDTOТип);		
		КолонкаXDTO.Имя      = Строка.Имя;
		КолонкаXDTO.Значение = Строка.Значение;
		
		КолонкиXDTO.Колонка.Добавить(КолонкаXDTO);
		
	КонецЦикла;
	
	ФайлXDTO.Колонки = КолонкиXDTO;
	
	// Термины (перезаписываем старый список всегда)
	
	ТерминыXDTOТип  = ФабрикаXDTO.Тип("http://v8.1c.ru/kms/1/ImportGlossarySettings", "Термины");
	ТерминыXDTO     = ФабрикаXDTO.Создать(ТерминыXDTOТип);
	
	ТерминXDTOТип  = ФабрикаXDTO.Тип("http://v8.1c.ru/kms/1/ImportGlossarySettings", "Термин");
	
	Для каждого Строка Из Термины Цикл
	
		ТерминXDTO = ФабрикаXDTO.Создать(ТерминXDTOТип);		
		ТерминXDTO.Наименование = Строка.Наименование;
		ТерминXDTO.Термин       = Строка.Термин;
		
		ТерминыXDTO.Термин.Добавить(ТерминXDTO);
		
	КонецЦикла;
	
	ФайлXDTO.Термины = ТерминыXDTO;
	
	// Электронный ресурс
	
	Если ИмяВладельцаТерминов = "ЭлектронныйРесурс" Тогда
		
		ФайлXDTO.СформироватьГлоссарии = СформироватьГлоссарии;
		
		// Листы (обновляем старый список)
		
		ЛистыXDTO = ФайлXDTO.Листы;
		
	    Если ЛистыXDTO = Неопределено Тогда
		
			ЛистыXDTO = ФабрикаXDTO.Создать(ФабрикаXDTO.Тип("http://v8.1c.ru/kms/1/ImportGlossarySettings", "Листы"));
			
			ФайлXDTO.Листы = ЛистыXDTO;
			
		КонецЕсли;
		
		Для каждого Строка Из Глоссарии Цикл
			
			ЛистXDTO = Неопределено;
			
			Для каждого СтрокаXDTO Из ЛистыXDTO.Лист Цикл
			
				Если СтрокаXDTO.Номер = Строка.Номер Тогда	
					ЛистXDTO = СтрокаXDTO;
					Прервать;
				КонецЕсли;
				
			КонецЦикла;
			
			Если ЛистXDTO = Неопределено Тогда
				
				ЛистXDTO = ФабрикаXDTO.Создать(ФабрикаXDTO.Тип("http://v8.1c.ru/kms/1/ImportGlossarySettings", "Лист"));		
				
				ЛистыXDTO.Лист.Добавить(ЛистXDTO);
				
			КонецЕсли;
			
			ЛистXDTO.Номер = Строка.Номер;
			
			Если НЕ ЗначениеЗаполнено(ЛистXDTO.Глоссарий) Тогда
				ЛистXDTO.Глоссарий = Строка.Глоссарий;
			КонецЕсли;
			
			ЛистXDTO.Скрыть = Строка.Скрыть;
			
		КонецЦикла;
		
	КонецЕсли;
	
	// Завершаем
	//
	
	ЗаписьXML = Новый ЗаписьXML;
	ЗаписьXML.УстановитьСтроку();
	ЗаписьXML.ЗаписатьОбъявлениеXML();
	
	ФабрикаXDTO.ЗаписатьXML(ЗаписьXML, ФайлНастроекXDTO);
	
	Возврат ЗаписьXML.Закрыть();
	
КонецФункции

&НаСервере
Процедура ЗагрузитьФайлНастроек()
	
	// Делаем проверки
	//
	
	Если НЕ ЗначениеЗаполнено(АдресФайлаНастроекВХранилище) Тогда
		Возврат;
	КонецЕсли;
	
	// Получаем нужные переменные
	//
	
	ПутьКФайлуСТерминамиОбъект = Новый Файл(ПутьКФайлуСТерминами);
	
	// Читаем файл настроек
	
	ПутьКФайлуНастроекНаСервере = ПолучитьИмяВременногоФайла("xml");
	
	ДвоичныеДанныеФайла = ПолучитьИзВременногоХранилища(АдресФайлаНастроекВХранилище);
	ДвоичныеДанныеФайла.Записать(ПутьКФайлуНастроекНаСервере);
	
	ЧтениеXML = Новый ЧтениеXML;
	ЧтениеXML.ОткрытьФайл(ПутьКФайлуНастроекНаСервере);
	
	// Получаем XDTO-объект файла настроек
	
	ФайлНастроекXDTOТип = ФабрикаXDTO.Тип("http://v8.1c.ru/kms/1/ImportGlossarySettings", "Файлы");
	ФайлНастроекXDTO    = ФабрикаXDTO.Создать(ФайлНастроекXDTOТип);
	ФайлНастроекXDTO    = ФабрикаXDTO.ПрочитатьXML(ЧтениеXML, ФайлНастроекXDTOТип); 
	
	// Ищем данные для текущего файла (в файле настроек могут быть данные нескольких файлов).
	
	ФайлXDTO = Неопределено;
	
	Для каждого Строка Из ФайлНастроекXDTO.Файл Цикл
	
		Если Строка.Имя = ПутьКФайлуСТерминамиОбъект.Имя Тогда	
			
			ФайлXDTO = Строка;
			
			Прервать;
			
		КонецЕсли;
		
	КонецЦикла;
	
	// Заполняем настройки из файла
	//
	
	Если ФайлXDTO <> Неопределено Тогда
		
		// Колонки
		
		Для каждого Строка Из Колонки Цикл
			
			Если ЗначениеЗаполнено(Строка.Значение) Тогда
				Продолжить; // Значение уже найдено по имени колонки
			КонецЕсли;
			
			КолонкаXDTO = Неопределено;
			
			Для каждого СтрокаXDTO Из ФайлXDTO.Колонки.Колонка Цикл	
				
				Если СтрокаXDTO.Имя = Строка.Имя Тогда
					КолонкаXDTO = СтрокаXDTO;
					Прервать;
				КонецЕсли;
				
			КонецЦикла;
			
			Если КолонкаXDTO <> Неопределено Тогда
				Строка.Значение = КолонкаXDTO.Значение;	
			КонецЕсли;
			
		КонецЦикла;

		// Термины
		
		Если ФайлXDTO.Термины <> Неопределено Тогда
		
			Для каждого Строка Из Термины Цикл
				
				ТерминXDTO = Неопределено;
				
				Для каждого СтрокаXDTO Из ФайлXDTO.Термины.Термин Цикл	
					
					Если СтрокаXDTO.Наименование = Строка.Наименование Тогда
						ТерминXDTO = СтрокаXDTO;
						Прервать;
					КонецЕсли;
					
				КонецЦикла;
				
				Если ТерминXDTO <> Неопределено Тогда
					Строка.Термин = ТерминXDTO.Термин;	
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЕсли;
		
		// ЭлектронныйРесурс
		
		Если ИмяВладельцаТерминов = "ЭлектронныйРесурс" Тогда
			
			Если ФайлXDTO.СформироватьГлоссарии <> Неопределено Тогда
				СформироватьГлоссарии = ФайлXDTO.СформироватьГлоссарии;
			КонецЕсли;
			
			// Листы
			
			Для каждого Строка Из Глоссарии Цикл
				
				ЛистXDTO = Неопределено;
				
				Для каждого СтрокаXDTO Из ФайлXDTO.Листы.Лист Цикл
				
					Если СтрокаXDTO.Номер = Строка.Номер Тогда
						ЛистXDTO = СтрокаXDTO;
						Прервать;	
					КонецЕсли;
				
				КонецЦикла;
				
				Если ЛистXDTO <> Неопределено Тогда
					
					Строка.Глоссарий = ЛистXDTO.Глоссарий;
					Строка.Скрыть    = ЛистXDTO.Скрыть;
					
					Если ОбщегоНазначенияСУКлиентСервер.СсылкаСуществуетВБазе(ЭлектронныйРесурс) Тогда
						Строка.ЭлементСодержанияДляОбновления = ОбщегоНазначенияСУ.НайтиЭлементСправочника("СодержаниеСУЗ", "СсылкаНаЭлемент", Строка.Глоссарий, ЭлектронныйРесурс, Ложь);
					КонецЕсли;
					
				КонецЕсли;
			
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЕсли;
	
	// Завершаем
	//
	
	ЧтениеXML.Закрыть();
	
	УдалитьФайлы(ПутьКФайлуНастроекНаСервере);
	
	УстановитьДоступностьЭлементовФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьФайлНастроек()
	
	ПутьКФайлуНастроек = ПолучитьИмяФайлаНастроек(ПутьКФайлуСТерминами);
	
	ФайлНастроекОбъект = Новый Файл(ПутьКФайлуНастроек);
	
	Если ФайлНастроекОбъект.Существует() И НЕ ФайлНастроекОбъект.ЭтоКаталог() Тогда
		
		ОписаниеОповещения = Новый ОписаниеОповещения("ОбработкаПолученияФайлаНастроек", ЭтотОбъект);		
		
		НачатьПомещениеФайла(ОписаниеОповещения,, ПутьКФайлуНастроек, Ложь, УникальныйИдентификатор);
		
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаПолученияФайлаНастроек(Результат, Адрес, ВыбранноеИмяФайла, ДополнительныеПараметры) Экспорт
	
	Если Результат Тогда
		АдресФайлаНастроекВХранилище = Адрес; // Реквизит
		ЗагрузитьФайлНастроек();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ПолучитьИмяФайлаНастроек(ПутьКФайлуСТерминами="")
	
	ИмяФайлаНастроек = "v8_GlossaryImportSettings.xml";
	
	Если ЗначениеЗаполнено(ПутьКФайлуСТерминами) Тогда
		
		ПутьКФайлуСТерминамиОбъект = Новый Файл(ПутьКФайлуСТерминами);
		
		ИмяФайлаНастроек = ОбщегоНазначенияСУКлиентСервер.ДобавитьКонечныйРазделительПути(ПутьКФайлуСТерминамиОбъект.Путь) + ИмяФайлаНастроек;
		
	КонецЕсли;
	
	Возврат ИмяФайлаНастроек; 
	
КонецФункции


#КонецОбласти
